app/views/teams/show.html.erb

SELECT "assigns".* FROM "assigns" WHERE "assigns"."team_id" = $1  [["team_id", 1]]
---
                <tbody>
                  <% @team.assigns.each do |assign| %>