app/views/shared/layout/_sidebar.html.erb

      <ul class="nav nav-pills nav-sidebar flex-column" data-widget="treeview" role="menu" data-accordion="false">
        <% @working_team.agendas.each do |agenda| %>
---
SELECT "agendas".* FROM "agendas" WHERE "agendas"."team_id" = $1  [["team_id", 1]]

            <ul class="nav nav-treeview" style="display: block;">
              <% agenda.articles.each do |article| %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."agenda_id" = $1  [["agenda_id", 10]]