app/controllers/agendas_controller.rb

SELECT "teams".* FROM "teams" INNER JOIN "assigns" ON "teams"."id" = "assigns"."team_id" WHERE "assigns"."user_id" = $1  [["user_id", 11]]
INSERT INTO "agendas" ("title", "created_at", "updated_at", "team_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Post 6"], ["created_at", "2021-07-14 22:19:46.826322"], ["updated_at", "2021-07-14 22:19:46.826322"], ["team_id", 1], ["user_id", 11]]
---
  def create
    @agenda = current_user.agendas.build(title: params[:title])
    @agenda.team = Team.friendly.find(params[:team_id])
    current_user.keep_team_id = @agenda.team.id
    if current_user.save && @agenda.save

SELECT  "agendas".* FROM "agendas" WHERE "agendas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."agenda_id" = $1  [["agenda_id", 2]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 3]]
SELECT "teams".* FROM "teams" INNER JOIN "assigns" ON "teams"."id" = "assigns"."team_id" WHERE "assigns"."user_id" = $1  [["user_id", 11]]
SELECT  "assigns".* FROM "assigns" WHERE "assigns"."team_id" = $1 LIMIT $2  [["team_id", 1], ["LIMIT", 1]]
SELECT "assigns".* FROM "assigns" WHERE "assigns"."team_id" = $1  [["team_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "agendas" WHERE "agendas"."id" = $1  [["id", 2]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "agendas" WHERE "agendas"."id" = $1  [["id", 3]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 18]]
---
  def destroy
    @agenda=Agenda.find(params[:id])
    @user=current_user
    #check Team Owner
    @team=Team.find(@agenda.team_id)
    if current_user.keep_team_id==@agenda.team.id || current_user.id=@team.owner_id

      #getting articles concerned
      @articles=@agenda.articles

      #destroying articles
      @articles.each do |article|
        Article.destroy(article.id)
      end

      #getting users
      @team_members_assign=Assign.where(team_id:@agenda.team_id)
      #then send them an email
      @team_members_assign.each do |member|
        @myUser=User.find(member.user_id)
        AgendasMailler.with(user: @user,agenda:@agenda,member:@myUser).delete_agenda_email.deliver
       end

      #delete agenda
      @agenda.destroy