app/controllers/assigns_controller.rb

SELECT  "assigns".* FROM "assigns" WHERE "assigns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    assign = Assign.find(params[:id])

SELECT COUNT(*) FROM "assigns" WHERE "assigns"."user_id" = $1  [["user_id", 3]]
---
  def assign_destroy(assign, assigned_user)

    if assigned_user == assign.team.owner
      I18n.t('views.messages.cannot_delete_the_leader')
    elsif Assign.where(user_id: assigned_user.id).count == 1

SELECT "teams".* FROM "teams" INNER JOIN "assigns" ON "teams"."id" = "assigns"."team_id" WHERE "assigns"."user_id" = $1  [["user_id", 11]]
---
  def set_next_team(assign, assigned_user)
    another_team = Assign.find_by(user_id: assigned_user.id).team

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_team(team_id)
    Team.friendly.find(params[:team_id])