app/controllers/teams_controller.rb

  def leave_rights
    redirect_to team_path
    @user=current_user
    @toUser=User.find(params[:assign].to_i)
    @team=Team.find(params[:id])

    if @user.id==@team.owner_id

    @toUser=User.find(params[:assign].to_i)
    @team=Team.find(params[:id])
    @team.update(owner_id:@toUser.id)
    @toUser.update(keep_team_id:@team.id)
    @user.update(keep_team_id: nil)
    LeaveRightsMailer.with(the_happy: @toUser,team:@team).leave_rights_email.deliver
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" INNER JOIN "assigns" ON "teams"."id" = "assigns"."team_id" WHERE "assigns"."user_id" = $1  [["user_id", 3]]