app/controllers/teams_controller.rb

  def leave_rights
    redirect_to team_path
    @user=current_user
    @toUser=User.find(params[:assign].to_i)
    @team=Team.find(params[:id])

    if @user.id==@team.owner_id

    @toUser=User.find(params[:assign].to_i)
    @team=Team.find(params[:id])
    @team.update(owner_id:@toUser.id)
    @toUser.update(keep_team_id:@team.id)
    @user.update(keep_team_id: nil)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "teams" SET "owner_id" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["owner_id", 11], ["updated_at", "2021-07-16 10:09:07.163186"], ["id", 1]]
UPDATE "users" SET "keep_team_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["keep_team_id", nil], ["updated_at", "2021-07-16 10:09:07.610284"], ["id", 3]]
UPDATE "users" SET "keep_team_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["keep_team_id", nil], ["updated_at", "2021-07-16 07:57:18.890300"], ["id", 4]]

  def update
    if @team.update(team_params)
      redirect_to @team, notice: I18n.t('views.messages.update_team')
---
UPDATE "teams" SET "owner_id" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["owner_id", 3], ["updated_at", "2021-07-16 07:57:18.856490"], ["id", 1]]

  def dashboard
    @team = current_user.keep_team_id ? Team.find(current_user.keep_team_id) : current_user.teams.first
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_team
    @team = Team.friendly.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]